Hello @vladimirvshivkov, 
I have tried it, I used the DCS id to do the import.  I however did run into a problem though, the `available_zones` and the `backup_policy` did not get imported.  I had to manually update the terraform state to prevent TF from trying to destroy and re-build the resource.  Not sure if this is an issue on my module on my end or if the import is missing that information.

```Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.redis["ec-test"].opentelekomcloud_dcs_instance_v1.this must be replaced
-/+ resource "opentelekomcloud_dcs_instance_v1" "this" {
      + access_user         = (known after apply)
      + available_zones     = [
          + "bf84aba586ce4e948da0b97d9a7d62fb",
          + "bf84aba586ce4e948da0b97d9a7d62fc",
        ] # forces replacement
      ~ created_at          = "2022-11-17T18:19:05.626Z" -> (known after apply)
      + description         = (known after apply)
      + enable_whitelist    = (known after apply)
      ~ id                  = "REMOVED" -> (known after apply)
      + internal_version    = (known after apply)
      ~ ip                  = "REMOVED" -> (known after apply)
      ~ maintain_begin      = "02:00:00" -> (known after apply)
      ~ maintain_end        = "06:00:00" -> (known after apply)
      ~ max_memory          = 128 -> (known after apply)
      ~ name                = "dcs-6e6s" -> "ec-test-redis-1"
      + order_id            = (known after apply)
      + password            = (sensitive value)
      ~ port                = 6379 -> (known after apply)
      ~ resource_spec_code  = "redis.ha.xu1.tiny.r2.128" -> (known after apply)
      + security_group_id   = ""
      + security_group_name = (known after apply)
      ~ status              = "RUNNING" -> (known after apply)
      ~ subnet_name         = "subnet-private" -> (known after apply)
      ~ used_memory         = 2 -> (known after apply)
      ~ user_id             = "REMOVED" -> (known after apply)
      ~ user_name           = "REMOVED" -> (known after apply)
      ~ vpc_name            = "REMOVED" -> (known after apply)
        # (6 unchanged attributes hidden)

      + backup_policy {
          + backup_at   = [
              + 1,
              + 2,
              + 4,
              + 6,
            ]
          + backup_type = "auto"
          + begin_at    = "00:00-01:00"
          + period_type = "weekly"
          + save_days   = 7
        }

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```